{
"건강학개론": "건강의 개념, 예방의학, 생활습관과 질병관리 등 건강한 삶을 위한 기초 지식을 배우는 과목입니다.",
"건축구조1": "건축물의 하중, 구조 계산의 기초 이론을 다루며, 구조물의 안전성과 안정성에 대한 이해를 높이는 과목입니다.",
"건축소방": "건축 설계 시 필수적인 소방 관련 법규와 시스템을 이해하고, 화재 예방 및 안전 설계 원칙을 학습합니다.",
"e-비즈니스개론": "인터넷 기반의 전자상거래, 디지털 마케팅, 온라인 비즈니스 환경의 이해를 위한 기본 과목입니다.",
"경영분석": "기업의 재무 상태와 경영성과를 수치로 분석하고, 의사결정에 필요한 데이터를 해석하는 방법을 배웁니다.",
"경영전략론": "기업의 성장과 생존을 위한 전략 수립 방법, 경쟁우위 확보 방안을 다루는 실전 중심의 과목입니다.",
"경영정보시스템": "정보기술(IT)을 활용한 경영활동의 효율화 방안과 시스템 구축에 대한 기초 이해를 제공합니다.",
"경영통계학": "통계학적 방법을 활용해 경영 데이터를 분석하고, 경영 의사결정에 적용하는 기초 통계 이론을 학습합니다.",
"경영학개론": "조직 경영의 전반적인 흐름과 기본 개념을 배우는 경영학의 입문 과목으로, 전체적인 이해를 돕습니다.",
"경영혁신": "기업의 혁신 활동, 기술 변화 대응, 조직 내 창의성과 변화를 다루는 전략적 사고 기반의 과목입니다.",
"경제학개론": "시장의 원리, 수요와 공급, 생산과 소비 등 경제의 기초 개념을 배우는 입문 경제학 과목입니다.",
"관광학개론": "관광산업의 개념, 구조, 역사 및 관광객 행동 등을 이해하며 관광경영의 기초를 다집니다.",
"광고학": "광고의 기본 원리, 매체 전략, 소비자 심리와 광고 기획 과정을 종합적으로 배우는 과목입니다.",
"국제경영": "글로벌 기업의 경영 전략, 해외시장 진출, 국제 무역 환경 등 국제 비즈니스 운영에 필요한 내용을 배웁니다.",
"리더십": "조직 내 리더의 역할, 리더십 유형, 효과적인 리더십 스킬과 팀 관리 능력을 기르는 과목입니다.",
"마케팅관리론": "마케팅 전략, 브랜드 관리, 시장세분화와 포지셔닝 등 실무 중심의 마케팅 관리 기법을 학습합니다.",
"마케팅원론": "소비자 행동, 마케팅 믹스(4P), 시장 분석 등 마케팅의 기초 개념과 흐름을 이해하는 입문 과목입니다.",
"무역학개론": "무역의 개념과 원리, 수출입 절차, 국제 무역 계약 및 규범 등 무역 실무의 기초를 배우는 과목입니다.",
"미시경제학": "소비자와 생산자의 선택, 시장 가격 결정 메커니즘 등 개별 경제 주체의 경제 활동을 중심으로 학습합니다.",
"생산관리": "제품과 서비스의 생산 과정에서 품질, 원가, 시간 등을 효율적으로 관리하는 기법과 이론을 배웁니다.",
"시장조사론": "고객 니즈 파악, 설문 설계, 통계분석 등 마케팅 활동을 위한 실질적인 시장 조사 방법을 다룹니다.",
"인력개발과활용": "인적 자원의 교육, 개발, 배치, 유지 전략을 통해 조직성과 향상을 도모하는 HRD 기반 과목입니다.",
"인적자원관리": "채용, 교육, 평가, 보상 등 조직 내 인재관리를 체계적으로 다루는 핵심 경영 과목입니다.",
"재무관리": "자본 조달, 투자, 배당, 리스크 관리 등 기업의 재무적 의사결정 과정을 다루는 과목입니다.",
"정책학원론": "공공정책의 형성과 집행 과정, 정책 분석 도구 등을 소개하며 정책 결정의 기초를 학습합니다.",
"조직행동론": "개인과 집단이 조직 내에서 어떻게 행동하고 상호작용하는지를 심리학적·사회학적으로 분석합니다.",
"투자론": "증권, 채권, 주식 등 다양한 투자 수단과 리스크 분석, 투자전략 수립 등을 배우는 과목입니다.",
"경찰수사론": "범죄 수사 절차, 과학수사기법, 증거 수집과 분석 등 경찰 수사의 기본 이론과 실제를 배우는 과목입니다.",
"경찰조직관리": "경찰 조직의 구조, 인사 운영, 갈등 해결 등 조직 운영에 필요한 관리 기법을 다룹니다.",
"경찰학개론": "경찰의 기능, 역할, 역사와 함께 한국 경찰 제도의 기본 구조를 폭넓게 이해할 수 있는 입문 과목입니다.",
"경찰행정법": "경찰 활동에 적용되는 법률과 법적 제한 사항을 배우며, 실무에서 필요한 법적 지식을 익힙니다.",
"경찰행정학": "경찰의 행정체계와 정책, 운영 전략 등을 종합적으로 학습하는 전공 핵심 과목입니다.",
"비교경찰론": "세계 주요 국가의 경찰 시스템과 정책을 비교하며, 국제적인 시각에서 경찰 제도를 이해합니다.",
"민간경비론": "민간 보안 산업의 구조, 법적 근거, 경비원 역할 등을 배우는 실무 중심 과목입니다.",
"범죄심리학": "범죄자의 심리와 행동 패턴을 분석하고, 범죄 예방과 수사에 필요한 심리학적 기초를 제공합니다.",
"범죄학개론": "범죄의 개념과 원인, 유형 및 범죄 통제 정책을 이론 중심으로 배우는 입문 과목입니다.",
"문화관광론": "문화와 관광의 연계를 이해하고, 관광 콘텐츠 개발과 지역문화 활성화에 대한 관점을 배웁니다.",
"생활과한의학": "한의학적 생활 건강 관리법, 체질 진단과 자연요법 등 실생활에 유용한 내용을 다룹니다.",
"생활법률": "일상에서 마주치는 법률 문제를 쉽게 풀어 설명하며, 기본적인 법 감각을 키우는 교양 과목입니다.",
"생활예절": "전통 예절과 현대적 매너, 사회적 커뮤니케이션에 필요한 예절 교육을 진행합니다.",
"여성학": "여성의 역사, 사회적 역할 변화, 성평등 이슈 등 다양한 시각에서 여성 문제를 다룹니다.",
"운동과건강": "건강한 신체 유지와 운동 방법에 대한 이해를 바탕으로 생활 속 건강 실천법을 배웁니다.",
"음악감상법I": "클래식 중심의 음악 감상 기초를 배우며, 감정 표현과 음악 이해력을 높이는 과목입니다.",
"재즈음악사": "재즈 음악의 기원과 역사, 주요 뮤지션과 스타일 변화 등을 소개하는 음악 교양 과목입니다.",
"현대사회의이해": "현대 사회의 구조, 변화, 이슈를 폭넓게 살펴보며 사회현상에 대한 통찰을 기르는 과목입니다.",
"소방기계시설론": "소방 기계설비의 구조, 작동 원리, 설계 기준을 이해하며 실제 설비 적용 능력을 키웁니다.",
"제어공학1": "자동 제어의 기본 이론과 제어 시스템의 구성 원리 등을 배우는 기초 전공 과목입니다.",
"노년학": "고령화 사회에서 노인의 생리, 심리, 사회적 변화에 대한 이해를 높이고 관련 제도도 함께 다룹니다.",
"노인교육론": "노년기 학습의 필요성과 효과, 교육방법 등을 배우며 고령층 대상 교육 프로그램 설계 능력을 기릅니다.",
"PC활용1": "컴퓨터 기본 사용법, 문서 작성, 데이터 처리 등 실생활과 직장에 유용한 컴퓨터 활용 능력을 배웁니다.",
"멀티미디어개론": "텍스트, 이미지, 오디오, 비디오 등 다양한 매체의 복합 원리를 이해하는 입문 과목입니다.",
"멀티미디어디자인1": "디지털 디자인의 기초 개념과 실습을 통해 시각 콘텐츠를 제작하는 능력을 키우는 과목입니다.",
"문헌정보학개론": "도서관, 정보센터 등에서 정보 자료를 관리하는 이론과 실제를 배우는 전공 입문 과목입니다",
"서지학개론": "책의 제작 과정, 서지적 기술, 도서 분류법 등 문헌 관리의 기초 개념을 다룹니다.",
"자료선택·구성론": "도서관에 필요한 자료의 선정, 수집, 분류 및 평가 과정을 종합적으로 학습합니다.",
"학교도서관경영론": "학교 도서관의 운영, 프로그램 개발, 독서교육 기능 등을 중심으로 구성된 실무 과목입니다.",
"공중보건학": "미용업 종사자에게 필요한 위생, 감염병 예방 등 보건 관련 기초 지식을 다루는 과목입니다.",
"모발과학": "모발의 구조와 기능, 두피 건강, 탈모 예방 등 모발 관리 이론을 체계적으로 배우는 과목입니다.",
"미용경영학": "미용업 창업, 경영 전략, 마케팅 등 미용 비즈니스 운영에 필요한 핵심 이론을 배웁니다.",
"미용과건강": "아름다움과 건강을 동시에 관리하는 방법을 중심으로, 건강한 라이프스타일을 제시하는 과목입니다.",
"미용문화사": "시대별 미용의 변천사와 문화적 의미를 탐구하며, 트렌드의 흐름을 이해합니다.",
"미용색채학": "색의 이론과 조화, 피부톤에 맞춘 색상 활용법 등 미용 분야에서 색채의 역할을 배우는 과목입니다.",
"미용학개론": "미용 전반의 개념, 역사, 분야별 흐름을 폭넓게 다루는 미용학의 입문 과목입니다.",
"복식문화": "의복의 역사, 패션과 사회문화의 연관성을 분석하며 현대 복식의 흐름을 이해합니다.",
"소독법과전염병학": "미용 도구 소독법, 감염병 예방 및 위생 관리에 필요한 실무 지식을 익히는 과목입니다.",
"실기교육방법론": "실기 수업 기획, 교수법, 피드백 기법 등을 학습하여 효과적인 실기 지도 능력을 기릅니다.",
"의상학": "의류 재료, 디자인 원리, 의복 제작과정 등을 통해 패션 디자인의 기초를 배우는 과목입니다.",
"인체생리학": "피부, 모발, 체형과 관련된 인체 기능과 구조를 이해하여 미용과의 연관성을 학습합니다.",
"코디네이트미학": "패션과 뷰티의 미적 조화를 통해 개성을 표현하는 코디네이션 기법을 다루는 과목입니다.",
"피부미용학": "피부 구조와 유형, 피부 관리 기법, 트러블 대처법 등을 종합적으로 배우는 전공 과목입니다.",
"화장품학": "화장품의 성분, 기능, 제조 원리 등을 이해하며 피부와의 상호작용을 분석하는 과목입니다.",
"동물복지및법규": "반려동물의 권리 보호와 동물 관련 법규의 이해를 통해 윤리적이고 책임 있는 관리 방법을 학습합니다.",
"동물행동심리학": "동물의 행동 패턴과 감정, 학습 능력 등을 분석하며 반려동물과의 상호작용을 이해하는 과목입니다.",
"법학개론": "법의 개념, 체계, 역할 등 기초 법학 이론을 배우며 전반적인 법률 체계를 이해하는 입문 과목입니다.",
"세법": "조세의 기본 개념, 세목별 과세 방식, 납세 의무 등 대한민국 세법 전반을 다룹니다.",
"형법1": "범죄와 형벌에 대한 일반 이론, 구성요건과 위법성 등을 중심으로 형법의 기초를 배우는 과목입니다.",
"형사소송법": "수사, 공판, 판결 과정에서의 절차적 법률 규정을 학습하며 형사 사법 절차의 흐름을 이해합니다.",
"풍수지리I": "지형, 지세, 방위 등을 고려한 전통 풍수 이론의 기초를 배우는 과목입니다.",
"풍수지리II": "실제 사례 중심의 풍수 해석과 응용을 통해 부동산 실무에 접목할 수 있는 심화 학습을 진행합니다.",
"가족상담및가족치료": "가족 내 갈등 해결과 치료적 접근법을 통해 건강한 가족 관계 회복을 돕는 상담 기법을 배웁니다.",
"가족생활교육": "가족의 역할, 관계, 의사소통 등을 중심으로 가족 구성원의 삶의 질 향상을 위한 교육 이론을 다룹니다.",
"건강가정론": "건강한 가정의 개념과 조건, 다양한 가족 유형에 대한 이론과 실천 전략을 학습합니다.",
"노인복지론": "고령화 시대에 대응하는 노인복지 정책, 서비스, 제도를 포괄적으로 이해하는 과목입니다.",
"사회문제론": "실업, 빈곤, 범죄, 가족 해체 등 현대 사회문제를 사회복지적 관점에서 분석합니다.",
"사회복지법제와실천": "사회복지 관련 법률과 현장 실천 간의 연계를 이해하고, 법에 근거한 실천 방법을 학습합니다.",
"사회복지실천기술론": "상담, 개입, 사정, 기록 등 현장에서 활용되는 실천 기술을 실무 중심으로 배우는 과목입니다.",
"사회복지실천론": "사회복지 실천의 철학과 접근 방법, 주요 모델을 이론 중심으로 학습하는 과목입니다.",
"사회복지윤리와철학": "사회복지사의 윤리적 책임과 가치, 철학적 기반을 고찰하는 이론 중심 과목입니다.",
"사회복지정책론": "사회복지 정책의 형성과정, 이념, 분석틀을 통해 제도적 접근 방식을 학습합니다.",
"사회복지조사론": "사회 현상을 조사하고 분석하는 통계적 방법과 연구 설계 기술을 배우는 과목입니다.",
"사회복지학개론": "사회복지의 개념, 역사, 대상, 전달체계 등 전반적 내용을 아우르는 입문 과목입니다.",
"사회복지행정론": "복지 조직의 관리, 운영, 평가에 관한 이론과 실제를 다루며 행정 실무 능력을 키웁니다.",
"사회복지현장실습": "복지기관에서의 실제 실습을 통해 이론과 실천을 연계하고 현장 감각을 익히는 과정입니다.",
"사회학개론": "사회 구조와 제도, 집단과 문화 등을 이해하며 인간 행동의 사회적 맥락을 배우는 과목입니다.",
"산업복지론": "직장 내 복지제도, 근로자 복지정책 등 산업 환경 속 사회복지의 실천 방향을 학습합니다.",
"상담이론과실제": "다양한 상담 이론과 그 적용 방식을 실제 사례를 통해 체계적으로 학습합니다.",
"여성복지론": "여성의 삶과 복지 문제를 성인지적 관점에서 조명하며 관련 정책과 서비스를 살펴봅니다.",
"의료사회복지론": "병원 및 의료기관 내 사회복지사의 역할과 환자 지원체계에 대해 배우는 전문 과목입니다.",
"인간행동과사회환경": "인간 발달과 사회 환경의 상호작용을 이해하며 개인의 행동을 종합적으로 분석하는 과목입니다.",
"자원봉사론": "자원봉사의 개념, 동기, 조직과 운영 방법 등 자원봉사 관리에 대한 전반을 배웁니다.",
"장애인복지론": "장애인의 권리 보장, 복지 제도, 실천 서비스 등을 종합적으로 학습하는 과목입니다.",
"정신건강론": "정신 건강의 개념과 주요 질환, 예방과 회복 전략 등을 통해 정신복지 이해를 높입니다.",
"지역사회복지론": "지역사회의 복지 욕구 파악, 프로그램 개발, 주민 참여 활성화를 중심으로 구성된 과목입니다.",
"프로그램개발과평가": "복지 프로그램의 기획, 실행, 평가 전 과정을 이론과 실제로 배우는 과목입니다.",
"학교사회복지론": "학생의 복지 지원, 학교 내 상담과 연계, 위기 개입 등을 중심으로 한 학교 현장 중심 과목입니다.",
"상담면접의기본기법": "상담 초기 관계 형성, 경청, 반영, 요약 등 기본적인 면접 기술을 익히는 실무 기초 과목입니다.",
"상담실습": "상담 이론을 실제 사례에 적용하고, 실습을 통해 상담 역량을 기르는 현장 중심 과목입니다.",
"상담학개론": "상담의 개념, 역사, 이론적 접근 등을 전반적으로 배우는 상담학 입문 과목입니다.",
"성인학습및상담": "성인의 학습 특성과 상담 접근법을 이해하며, 성인 대상 교육 및 상담에 대한 실무 능력을 기릅니다.",
"소방관계법규1": "소방 관련 주요 법령과 규정의 구조를 배우며 소방 행정 실무에 필요한 법 지식을 익히는 과목입니다.",
"소방원론": "소방의 개념과 역사, 소화 이론, 화재 예방 및 진압의 기본 원리를 배우는 기초 과목입니다.",
"소방유체역학": "소방 시스템에서 사용하는 유체의 흐름과 압력, 손실 등 이론을 이해하는 전문 과목입니다.",
"소방전기시설론": "감지기, 비상방송 등 소방전기설비의 구조와 작동 원리를 중심으로 학습하는 과목입니다.",
"소방학개론": "화재 예방, 인명 구조, 방재 대책 등 소방학의 전반을 개괄하는 입문 과목입니다.",
"소방행정론": "소방 조직의 운영, 인사관리, 정책 수립 등 행정 실무 전반을 배우는 과목입니다.",
"소방행정법": "소방 업무와 관련된 법적 근거, 집행 절차 등을 중심으로 구성된 실무 법학 과목입니다.",
"수계소화설비": "스프링클러, 물분무 소화설비 등 수계를 이용한 소화 시스템의 작동 원리와 설계 기준을 학습합니다.",
"위험물시설론": "위험물의 특성과 보관·취급 시설의 기준 및 관리 방법을 중심으로 구성된 안전관리 과목입니다.",
"위험물질론": "연소성, 폭발성 물질의 특성과 분류, 대처 방안을 이해하여 사고 예방에 기여할 수 있는 과목입니다.",
"재난관리론": "자연재해와 사회재난에 대한 대응 체계, 예방 전략, 복구 과정 등을 포괄적으로 배우는 과목입니다.",
"피난안전설계": "화재 시 피난 경로 설계, 인명 안전 확보 방안 등을 중심으로 건축적·기술적 해법을 학습합니다.",
"화재원론": "연소의 원리, 화재 발생 메커니즘, 화재 확산의 특성을 체계적으로 이해하는 소방 전문 과목입니다.",
"표현기법": "다양한 시각 표현 기법을 실습하며 창의적이고 효과적인 이미지 표현 능력을 키우는 과목입니다.",
"기초디자인": "디자인의 기본 원리인 형태, 색채, 구성 등을 실습 중심으로 배우는 디자인 입문 과목입니다.",
"디자인경영과브랜드전략": "디자인을 활용한 브랜드 가치 창출, 전략적 기획, 시장 경쟁력 확보 방안을 학습합니다.",
"디자인론": "디자인의 철학, 역사, 기능 등을 폭넓게 고찰하며 디자인의 본질에 대해 탐구하는 과목입니다.",
"디자인리서치와마케팅": "소비자 조사와 시장 분석을 바탕으로 디자인 전략을 수립하는 실무 중심의 과목입니다.",
"디자인마케팅": "디자인이 마케팅에 미치는 영향을 분석하고, 소비자 감성 중심의 마케팅 전략을 학습합니다.",
"디자인방법론": "문제 해결 중심의 디자인 프로세스, 창의적 아이디어 도출 방식 등을 체계적으로 학습합니다.",
"디자인사": "고대부터 현대까지 디자인의 변화와 발전 과정을 이해하며, 시대별 디자인 흐름을 학습합니다.",
"디자인세미나": "디자인 이슈, 트렌드, 사례 분석 등을 통해 실무 감각과 비평 능력을 함께 키우는 과목입니다.",
"디자인제도": "디자인 실무에 필요한 평면 및 입체 제도 능력을 학습하여 표현력과 설계 이해도를 높입니다.",
"색채학": "색의 원리, 심리적 효과, 조화 이론 등 디자인 전반에 필요한 색채 이론을 배우는 과목입니다.",
"시각디자인": "정보 전달을 위한 시각 요소 구성 능력을 키우며, 포스터, 편집, 광고 등 실무 디자인을 다룹니다.",
"시각디자인론": "시각적 커뮤니케이션의 개념과 구조, 매체별 표현 방식을 이론적으로 탐구하는 과목입니다.",
"웹디자인": "사용자 중심의 웹사이트 구조, UI/UX 디자인 및 HTML/CSS 기초 등 웹 기반 시각디자인을 배웁니다.",
"인터페이스디자인": "인간과 디지털 시스템 간 상호작용을 고려한 직관적 인터페이스 설계 방법을 학습합니다.",
"타이포그래피": "글자의 형태와 배열, 가독성, 시각적 표현 등 타이포의 조형적 활용을 중심으로 구성된 과목입니다.",
"프레젠테이션": "기획안, 포트폴리오, 아이디어 등을 효과적으로 시각화하여 전달하는 표현 능력을 기릅니다.",
"가구디자인": "기능성과 미적 감각을 조화시킨 가구 설계를 배우며, 공간 연출을 위한 기초를 다지는 과목입니다.",
"상담심리학": "개인과 집단의 심리적 문제 해결을 위한 상담 이론과 실제 상담 기법을 통합적으로 학습합니다.",
"대인관계의심리학": "사람 간의 관계 형성과 갈등, 의사소통 방식 등을 심리학적 관점에서 분석하는 과목입니다.",
"사이버심리학": "온라인 공간에서의 인간 행동, 디지털 정체성, SNS 심리 등을 다루는 현대 심리학 과목입니다.",
"사회심리학": "집단 속에서의 인간 행동, 태도, 고정관념, 사회적 영향 등을 연구하는 심리학의 한 분야입니다.",
"산업심리학": "조직 내 인간 행동, 직무 스트레스, 동기부여 등을 이해하며, 직장 내 효율성과 복지를 높이는 방법을 다룹니다.",
"생활지도와상담": "청소년 및 성인을 위한 생활지도의 기본 개념과 상담 전략을 익히는 교육심리학 기반 과목입니다.",
"성격심리학": "성격의 유형, 형성과 발달, 성격 평가 도구 등을 통해 개인 차이를 분석하는 과목입니다.",
"소비자심리학": "소비자의 행동 패턴, 구매 동기, 브랜드 태도 등을 심리학적으로 분석하여 마케팅과 연결합니다.",
"심리학개론": "인간의 사고, 감정, 행동을 과학적으로 이해하기 위한 기초 심리학 개념과 이론을 배우는 과목입니다.",
"이상심리학": "정신질환과 이상행동의 원인, 진단, 치료 등을 다루며 임상심리의 기초를 형성하는 과목입니다.",
"인간관계론": "원만한 인간관계의 조건, 갈등 해결, 상호작용 전략 등을 이론과 사례 중심으로 배우는 과목입니다.",
"인간행동의심리학적이해": "인간의 행동을 심리학적 관점에서 다각도로 해석하며, 실생활 적용 능력을 기릅니다.",
"인지심리학": "기억, 주의, 사고, 언어 등 인간의 인지 기능을 과학적으로 탐구하는 심리학의 핵심 분야입니다.",
"임상심리학": "정신적 장애의 진단 및 치료, 심리 평가 도구 활용 등을 중심으로 구성된 전문 심리 과목입니다.",
"정서심리학": "감정의 발생 원인과 조절 전략, 정서의 생리적·인지적 메커니즘을 학습하는 감정 중심 과목입니다.",
"조직심리학": "조직 내 인간행동, 팀워크, 리더십, 조직문화 등 직장 내 심리적 요소를 분석하는 과목입니다.",
"학습심리학": "인간의 학습 원리, 조건화 이론, 강화 전략 등을 다루며 교육 및 행동 수정의 기초를 제공합니다.",
"행동수정": "바람직한 행동 증진과 문제 행동 감소를 위한 심리학적 중재 전략을 실무 중심으로 학습합니다.",
"가족관계론": "가족 내 역할과 상호작용, 갈등 해결 방법 등을 배우며 건강한 가족관계 형성에 대해 학습합니다.",
"가족복지론": "가족을 지원하는 복지 정책과 서비스, 다양한 가족 형태에 따른 복지 접근 방법을 다룹니다.",
"결혼과가족": "결혼과 가족생활의 이론적 이해를 통해 가족 형성과 유지, 해체 과정을 분석하는 과목입니다.",
"놀이지도": "영유아의 발달을 지원하는 놀이의 중요성과 교수 전략, 다양한 놀이활동 설계 방법을 배우는 과목입니다.",
"미술치료": "아동의 심리적 표현과 치유를 위한 미술 매체 활용 방법과 이론을 학습합니다.",
"발달심리": "인간의 성장과 발달 과정 전반을 이해하며, 특히 아동기의 심리 발달 특성을 중점적으로 다룹니다.",
"보육과정": "보육기관에서의 교육과정 구성 원리와 연령별 프로그램 기획·운영 방안을 학습합니다.",
"보육교사론": "보육교사의 역할과 자질, 전문성 향상을 위한 이론과 실천 역량을 기르는 과목입니다.",
"보육실습": "보육 현장에서의 실제 교육과 돌봄을 체험하며, 이론과 실습을 통합적으로 경험하는 과목입니다.",
"보육학개론": "보육의 개념, 목적, 역사적 배경 등 보육학의 기초 이론을 폭넓게 배우는 입문 과목입니다.",
"부모교육론": "부모의 역할과 자녀 양육 기술, 부모 교육 프로그램 구성 및 효과에 대해 다루는 과목입니다.",
"아동가족의이해": "아동이 속한 가족 환경과 그 영향을 이해하고, 아동 발달에 있어 가족의 중요성을 학습합니다.",
"아동건강교육": "아동기의 건강관리, 질병 예방, 신체활동 교육 등의 실질적인 건강 증진 내용을 포함합니다.",
"아동관찰및행동연구": "아동의 행동을 체계적으로 관찰하고 분석하며, 개별 특성을 이해하는 방법을 학습합니다.",
"아동권리와복지": "아동의 기본 권리를 이해하고, 이를 보호·실현하기 위한 사회복지적 접근을 배우는 과목입니다.",
"아동문학교육": "동화, 동시 등 아동문학 작품을 활용한 정서 교육과 창의력 증진 방안을 학습합니다.",
"아동미술": "아동의 미술 표현 특성과 발달 단계에 따른 지도 방안 및 창의적 활동을 다루는 과목입니다.",
"아동발달": "신체, 인지, 사회·정서적 발달 등 아동기의 전반적 성장 과정을 통합적으로 학습합니다.",
"아동복지론": "아동의 권리 실현을 위한 복지제도와 서비스, 문제 상황에 대한 대응 방안을 배우는 과목입니다.",
"아동상담론": "아동의 심리적 문제를 다루는 상담 기법과 개입 방법에 대해 실제 사례를 통해 학습합니다.",
"아동수학지도": "수 개념, 도형, 분류와 비교 등 유아 수학교육의 기초 개념과 지도 전략을 학습합니다.",
"아동안전관리": "아동 대상 사고 예방, 응급처치, 안전 교육 등 보육현장에서 꼭 필요한 안전관리 내용을 다룹니다.",
"아동영양학": "아동기의 균형 잡힌 식단 구성, 성장 발달에 필요한 영양소와 식생활 지도 방법을 배우는 과목입니다.",
"아동음악": "다양한 음악 요소를 활용한 표현 활동을 통해 아동의 감성과 창의력을 키우는 교육을 학습합니다.",
"언어발달장애": "언어발달의 지연 또는 이상 징후를 파악하고, 언어장애의 원인과 치료법에 대해 배우는 과목입니다.",
"언어지도": "아동의 언어 능력 향상을 위한 의사소통 기술, 읽기·쓰기 지도 방법 등을 포괄적으로 다룹니다.",
"영아발달": "생후~만 3세까지의 발달 특성과 요구를 이해하고, 발달에 적합한 양육 및 자극 제공을 학습합니다.",
"영유아교수방법론": "영유아 대상 교수-학습 이론과 실제 수업 구성 방법을 종합적으로 배우는 실무 중심 과목입니다.",
"영유아발달": "출생부터 유아기까지의 발달 과정과 그에 따른 교육적 접근법을 배우는 핵심 전공 과목입니다.",
"영유아보육프로그램개발과평가": "연령별 발달에 적합한 보육 프로그램을 기획하고, 운영성과를 평가하는 방법을 배우는 실무 중심 과목입니다.",
"유아발달": "유아기의 신체, 인지, 정서 발달 특성을 심층적으로 이해하며 발달 단계별 교육 접근을 다룹니다.",
"유아특수교육학": "발달 지체 또는 장애를 가진 유아를 위한 특수교육 이론과 지원 방법을 학습합니다.",
"자폐장애교육": "자폐 스펙트럼 장애의 특성과 교육적 지원 방안, 개별화 교육계획(IEP) 수립법 등을 다루는 과목입니다.",
"장애영유아교수방법론": "장애가 있는 영유아를 위한 교수 전략, 개별화 수업 설계 등 실천 중심의 지도법을 학습합니다.",
"정서장애아교육": "정서적 문제를 가진 아동의 특성과 행동 지원 방안을 교육적 관점에서 학습하는 과목입니다.",
"지적장애아교육": "인지 능력이 낮은 아동을 위한 교수 전략과 생활적응 중심 교육 내용을 구성하는 과목입니다.",
"특수아부모교육론": "장애 아동 부모를 위한 상담, 교육, 정서적 지원 방법 등을 배우는 과목입니다.",
"특수아상담": "특수아동과 그 가족을 위한 상담 이론과 실제 기법을 학습하며, 문제 해결 중심 접근을 다룹니다.",
"특수아통합교육": "일반 아동과 특수 아동이 함께 배우는 통합 교육 환경의 운영 방법과 제도적 이해를 다룹니다.",
"미국문학개론": "미국 문학의 역사적 흐름과 대표 작가들의 작품을 통해 미국 문화의 흐름을 이해하는 입문 과목입니다.",
"비지니스무역영어": "수출입 계약, 비즈니스 이메일, 무역 용어 등 실무 중심의 비즈니스 영어 표현을 학습합니다.",
"세익스피어": "윌리엄 셰익스피어의 대표 작품과 시대적 배경, 문학적 영향력을 분석하는 심화 문학 과목입니다.",
"시사영어": "뉴스, 시사 잡지, 칼럼 등을 읽고 토론하며 시사 영어 능력을 향상시키는 실용 과목입니다.",
"실용영문법": "일상생활과 직장생활에서 필요한 핵심 영문법을 실제 예문 중심으로 쉽게 학습하는 과목입니다.",
"실용영어회화": "다양한 상황에서 원활한 의사소통을 위한 회화 표현과 발음, 억양을 실습하는 실용 중심 과목입니다.",
"실용영작문": "이메일, 자기소개서, 짧은 에세이 등 실생활에 필요한 작문 실력을 향상시키는 실용 작문 과목입니다.",
"영국소설": "영국 문학의 전통과 발전 과정을 대표 소설 작품을 통해 분석하는 심화 문학 과목입니다.",
"영문법": "영어 문장의 구조와 문법 규칙을 체계적으로 이해하며 고급 문장 구성 능력을 기릅니다.",
"영문학개론": "영미문학의 흐름, 장르, 대표 작가를 폭넓게 소개하며 문학적 감수성을 기르는 입문 과목입니다.",
"영미시": "영국과 미국의 주요 시 작품을 읽고 해석하며, 시의 형식과 기법을 이해하는 과목입니다.",
"영어강독I": "다양한 영문 텍스트를 정독하며 독해 능력과 어휘력, 문법 해석 능력을 함께 키우는 기초 과목입니다.",
"영어교수방법론": "영어 교육 이론, 학습자 중심 수업 전략, 수업 설계 및 평가 방법 등을 배우는 교육 전공 과목입니다.",
"영어교수법": "실무 중심의 영어 수업 진행 기법, 교재 활용법, 활동 설계 등을 다루는 영어교육 실습 과목입니다.",
"영어독해법": "문장 구조 분석, 핵심어 찾기, 긴 문장 해석 등 효율적인 독해 전략을 익히는 과목입니다.",
"영어통사론": "영어 문장의 구조와 구성 규칙을 분석하며, 문장 생성의 원리를 이해하는 이론 중심 과목입니다.",
"영어학개론": "언어학의 기본 개념과 영어의 구조, 의미, 음운 등을 포괄적으로 다루는 영어학 입문 과목입니다.",
"영어회화I": "기본적인 상황에서 활용할 수 있는 일상 영어 회화 능력을 향상시키는 초급 실습 과목입니다.",
"영작문I": "영어 문장의 구조를 이해하고, 짧은 문장부터 단락 구성까지 단계별 작문 기술을 익히는 과목입니다.",
"외국어로서의한국어교육과정및교수요목설계": "한국어 교육과정의 구성 원리와 교수요목의 설계 방식, 단계별 목표 설정 및 수업 구성법을 학습합니다.",
"교육학개론": "교육의 철학, 심리학, 사회학적 기초를 배우며 교사로서 갖추어야 할 교육 전반의 이론을 이해하는 과목입니다.",
"대조언어학": "한국어와 다른 언어 간의 음운, 어휘, 문법을 비교하여 학습자 오류를 예측하고 지도 방안을 모색하는 과목입니다.",
"사회언어학": "언어와 사회의 관계, 방언, 언어 태도, 언어 정책 등 사회적 맥락 속에서의 언어 사용 양상을 분석합니다.",
"언어학개론": "언어의 본질, 구조, 기능 등 언어학의 기본 개념을 소개하는 입문 이론 과목입니다.",
"외국어로서의언어교수이론": "제2언어 습득 이론을 바탕으로 한 교수 방법론과 수업 전략을 체계적으로 배우는 필수 이론 과목입니다.",
"외국어로서의한국어교육개론": "외국인을 위한 한국어 교육의 목표, 역사, 교수법의 흐름 등 전반적 내용을 소개하는 입문 과목입니다.",
"외국어로서의한국어교육실습": "실제 수업 관찰과 수업 진행을 통해 교수 전략을 실전에 적용하고 교사 역량을 기르는 실습 과목입니다.",
"외국어로서의한국어교재론": "한국어 교육 교재의 구성 원리, 평가 기준, 교재 개발 방법 등을 중심으로 실무 능력을 배웁니다.",
"외국어로서의한국어능력평가론": "평가 도구의 설계, 문항 개발, 학습자 언어 능력 평가의 원리와 실제를 배우는 과목입니다.",
"외국어로서의한국어문법교육론": "외국인 학습자를 위한 한국어 문법 지도 방법, 단계별 설명 전략 등을 중심으로 구성된 과목입니다.",
"외국어로서의한국어발음교육론": "한국어의 음운 체계와 발음 교육의 어려움, 오류 교정 방법 등을 실습과 함께 배우는 과목입니다.",
"외국어로서의한국어어휘교육론": "어휘 학습 이론과 어휘 지도 전략, 단어 선택 기준 등을 중심으로 효과적인 어휘 수업 방법을 배웁니다.",
"외국어로서의한국어이해교육론": "듣기·읽기 능력 향상을 위한 전략, 학습자의 이해 능력 평가 방법 등을 학습하는 이론+실습 과목입니다.",
"외국어로서의한국어표현교육론": "말하기·쓰기 등 표현 능력 향상을 위한 교수 전략, 오류 유형 분석, 활동 설계법 등을 배우는 과목입니다.",
"외국어로서의한국어학개론": "한국어를 외국어로 가르치는 데 필요한 언어학 이론을 종합적으로 소개하는 입문 이론 과목입니다.",
"외국어습득론": "언어 습득의 심리·인지적 메커니즘, 제2언어 학습자의 발달과 오류를 이론적으로 분석합니다.",
"외국인을위한한국문화교육론": "외국 학습자에게 한국 문화를 효과적으로 전달하기 위한 교수 전략과 문화 콘텐츠 구성법을 학습합니다.",
"한국문학개론": "고전부터 현대까지 한국문학의 흐름과 주요 작품을 이해하며 한국 문화 배경을 넓히는 문학 입문 과목입니다.",
"한국문화교육론": "외국인을 위한 문화 교육 설계, 문화 비교 시각, 교육 자료 개발 등 실제 수업 활용법을 중심으로 학습합니다.",
"한국사의이해": "한국의 역사적 흐름과 주요 사건을 중심으로, 언어와 문화의 맥락 이해를 돕는 기초 교양 과목입니다.",
"한국어문법론": "한국어 문장의 구조, 어미, 조사, 통사 구조 등을 분석하고 설명하는 심화 문법 이론 과목입니다.",
"한국어어문규범": "한글 맞춤법, 표준어 규정, 외래어 표기법 등 한국어 사용의 규범과 기준을 배우는 필수 교과목입니다.",
"한국어음운론": "음절, 자음·모음 체계, 음운 변동 규칙 등을 중심으로 한국어의 소리 구조를 이론적으로 탐구합니다.",
"한국어의미론": "단어의 의미 구조, 중의성, 의미 관계 등 한국어 단어와 문장의 의미 체계를 분석하는 과목입니다.",
"한국의현대문화": "음식, 의식주, 대중문화, 사회 트렌드 등을 통해 오늘날 한국 사회의 문화적 특성을 이해합니다.",
"현대한국사회": "정치, 경제, 교육, 가족, 세대 등 다양한 분야에서 변화하는 한국사회의 모습을 분석하는 교양 과목입니다.",
"공업수학1": "전기·전자 분야의 기초가 되는 미분방정식, 선형대수, 벡터해석 등의 수학적 이론을 학습합니다.",
"공업수학2": "복소함수, 푸리에 해석, 라플라스 변환 등 공학적 문제 해결에 필요한 고급 수학 기법을 다룹니다.",
"공업통계": "품질관리, 신뢰성 분석 등 공학 데이터를 수치적으로 해석하고 예측하는 통계 기초 과목입니다.",
"전기기기1": "변압기, 직류기, 교류기의 기본 구조와 동작 원리를 이해하고 응용 능력을 키우는 과목입니다.",
"전기설비1": "건축물 및 산업 현장의 전기 설비 시스템 설계와 시공, 유지관리의 기초를 학습합니다.",
"전기응용1": "전기에너지를 활용한 응용 기술(전열, 전동, 조명 등)의 원리와 응용 분야를 이해하는 과목입니다.",
"전기회로1": "저항, 인덕터, 커패시터 등 기본 소자의 이론과 회로 해석을 중심으로 전기회로의 기초를 배웁니다.",
"전기회로2": "복잡한 교류 회로, 과도 현상, 주파수 응답 등 고급 회로 해석 기법을 학습합니다.",
"전기회로실험1": "이론에서 배운 전기회로 원리를 실제 실험을 통해 검증하고 응용 능력을 강화하는 실습 과목입니다.",
"전력공학1": "발전, 송전, 배전 시스템의 구조와 기본 이론을 통해 전력 시스템의 기초를 이해합니다.",
"전력공학2": "고급 전력 시스템의 안정성, 효율성, 경제성 등을 심화 분석하는 전력공학 응용 과목입니다.",
"전력발생공학": "수력, 화력, 원자력, 신재생에너지 등 다양한 발전 방식의 원리와 설비 구조를 학습합니다.",
"전자기학1": "정전기장, 정자기장, 가우스 법칙 등 전자기 기본 이론을 수학적으로 분석하고 이해하는 과목입니다.",
"정보통신개론": "정보통신 시스템의 구성, 네트워크, 전송 기술 등 전체 구조를 폭넓게 소개하는 입문 과목입니다.",
"정보통신기기1": "통신 기기의 동작 원리, 회로 구성, 응용 사례 등을 중심으로 실무 지식을 배우는 기초 과목입니다.",
"지식재산개론": "특허, 상표, 디자인, 저작권 등 지식재산권의 종류와 보호 제도 전반을 이해하는 입문 과목입니다.",
"교육사회학": "교육과 사회의 상호작용, 교육 불평등, 사회 구조 내 교육의 기능 등을 다루는 이론 과목입니다.",
"교육심리학": "학습자의 심리 발달, 동기, 학습이론 등을 통해 교육 효과를 높이는 이론을 학습합니다.",
"성장기자녀의이해와부모역할": "성장기 자녀의 발달 특성과 부모의 양육 역할을 이해하고 올바른 부모 역할을 탐색합니다.",
"성행동의심리학": "인간의 성 행동, 성 역할 발달, 성 정체성 등의 심리학적 이론과 상담적 접근을 배우는 과목입니다.",
"직업ㆍ진로설계": "진로 탐색과 경력 개발을 위한 이론과 실습을 통해 청소년의 진로 지도 능력을 키우는 과목입니다.",
"청소년문제와보호": "가출, 폭력, 인터넷 중독 등 청소년의 문제 행동과 그 예방·개입 방안을 배우는 실무 중심 과목입니다.",
"청소년문화": "청소년의 하위문화, 유행, 가치관 등을 이해하고 그 사회문화적 의미를 분석하는 과목입니다.",
"청소년복지론": "청소년을 위한 복지 정책, 제도, 서비스 제공 방식 등을 폭넓게 배우는 기초 복지 과목입니다.",
"청소년심리및상담": "청소년기의 심리 발달과 문제 행동에 대한 상담 이론과 개입 전략을 학습합니다.",
"청소년육성제도론": "청소년 관련 법과 정책, 육성 체계, 행정 조직 등 제도적 기반을 이해하는 과목입니다.",
"청소년이해론": "발달심리, 사회문화, 교육적 측면에서 청소년을 다각도로 이해하는 이론 중심 과목입니다.",
"청소년지도방법론": "청소년 활동의 지도 원칙, 활동 기획, 평가 기법 등 지도자의 실무 능력을 기르는 과목입니다.",
"청소년프로그램개발및평가": "청소년 대상 프로그램을 기획하고 실행한 뒤 평가하는 전 과정에 대한 이론과 실습을 병행합니다.",
"청소년활동론": "캠프, 자원봉사, 체험학습 등 다양한 활동의 목적과 운영 방법을 배우는 실무 중심 과목입니다.",
"현대인의정신건강": "스트레스, 우울, 불안 등 현대인의 주요 정신건강 문제와 예방·관리 방법을 탐색하는 교양 과목입니다.",
"건강관리": "건강 유지와 질병 예방을 위한 생활습관, 운동, 영양 등 건강 증진 실천 전략을 배우는 과목입니다.",
"사회체육개론": "지역사회에서 이루어지는 체육 활동의 필요성과 운영 체계, 사회적 가치 등을 이해합니다.",
"생활체육론": "전 연령층을 위한 일상 속 체육활동의 기획, 실행, 효과 등을 학습하는 실용 중심 과목입니다.",
"스포츠마케팅": "스포츠 산업에서의 마케팅 전략, 브랜드 관리, 스폰서십 등을 학습하는 실무 응용 과목입니다.",
"스포츠사회학": "스포츠와 사회 구조, 계층, 젠더, 대중문화의 상호작용을 탐구하는 이론 과목입니다.",
"스포츠심리학": "운동선수와 일반인의 심리적 특성, 동기, 자신감, 스트레스 관리 등 심리적 요인을 분석합니다.",
"스포츠영양학": "운동성과 향상과 체력 관리를 위한 영양소의 기능과 식단 계획을 배우는 과목입니다.",
"신체훈련론": "체력 요소별 훈련 이론과 실제 프로그램 구성 방법 등을 중심으로 배우는 실습 기반 과목입니다.",
"여가및레크리에이션": "여가활동과 레크리에이션의 의미, 사회적 가치, 프로그램 운영 방법을 이해합니다.",
"운동생리학": "운동 중 인체의 생리적 반응과 적응 과정을 이해하여 효율적인 트레이닝을 설계할 수 있도록 합니다.",
"운동역학": "신체 움직임에 작용하는 물리적 힘과 운동 원리를 분석하는 과목입니다.",
"운동학습": "운동 기능의 습득과 향상 과정을 뇌와 신경계 관점에서 탐구합니다.",
"체육사": "고대부터 현대까지 체육의 발전과 시대별 체육 제도의 변화를 이해하는 역사 과목입니다.",
"체육철학": "체육과 스포츠의 철학적 기반, 윤리, 교육적 의미 등을 고찰하는 이론 중심 과목입니다.",
"체육측정평가": "체육 활동의 성과를 과학적으로 측정하고 평가하는 방법을 학습합니다.",
"체육학개론": "체육의 정의, 목적, 역사 및 주요 이론을 개괄적으로 배우는 입문 과목입니다.",
"체육학연구법": "체육학 분야의 학술 연구 설계, 자료 수집 및 분석 방법을 학습하는 기초 연구 과목입니다.",
"태극권Ⅰ": "태극권의 기본 동작과 호흡, 움직임 원리를 배우며 신체 단련과 심신 조화를 목표로 하는 실습 과목입니다.",
"트레이닝론": "체력 요소 개발을 위한 훈련 원칙, 트레이닝 이론과 계획 수립 방법을 배우는 과목입니다.",
"트레이닝방법론": "트레이닝 기법의 실제 적용, 종목별 훈련법, 프로그램 구성 등을 실습 중심으로 배우는 과목입니다.",
"객체지향프로그래밍I": "클래스, 상속, 다형성 등 객체지향 개념을 바탕으로 실제 프로그램 구조 설계를 익히는 과목입니다.",
"네트워크1": "데이터 통신의 기본 원리, OSI 7계층, IP 구조 등 컴퓨터 네트워크의 기초 이론을 학습합니다.",
"네트워크프로그래밍": "소켓 프로그래밍을 활용하여 클라이언트-서버 구조의 응용프로그램 개발 능력을 배웁니다.",
"데이터베이스": "관계형 데이터베이스 설계, SQL 활용, 트랜잭션 개념 등 데이터 저장 및 관리 기술을 학습합니다.",
"데이터통신": "전송 매체, 오류 검출, 변조 방식 등 컴퓨터 간 정보 교환 기술을 중심으로 배우는 과목입니다.",
"디지털공학개론": "논리회로, 부울대수, 플립플롭 등 디지털 논리의 기본 개념과 회로 설계 기초를 익히는 과목입니다.",
"디지털신호처리": "신호의 디지털 처리 방식, 필터 설계, 푸리에 변환 등을 활용한 응용 기술을 학습합니다.",
"마이크로프로세서1": "마이크로프로세서의 구조, 명령어 집합, 어셈블리 언어 기반 하드웨어 제어 기술을 배웁니다.",
"모바일프로그래밍": "안드로이드 등 모바일 플랫폼에서 앱을 개발하며 UI 설계, 이벤트 처리 기법을 학습합니다.",
"빅데이터개론": "빅데이터 개념, 수집 및 분석 기술, 활용 사례 등을 포괄적으로 소개하는 입문 과목입니다.",
"소프트웨어공학": "소프트웨어 개발 생명주기, 요구사항 분석, 테스트 및 유지보수에 대한 체계적 접근법을 학습합니다.",
"시스템분석설계": "정보 시스템 구축을 위한 요구 분석, 모델링, 설계 도구 사용법을 익히는 과목입니다.",
"시스템프로그래밍": "운영체제 기능, 컴파일러, 링커, 어셈블러 등 시스템 수준 소프트웨어를 다루는 과목입니다.",
"알고리즘": "정렬, 탐색, 그래프, 동적 계획법 등 문제 해결을 위한 알고리즘 설계와 분석 능력을 기릅니다.",
"암호프로토콜": "보안 통신을 위한 암호 기술 및 인증 프로토콜의 이론과 실무를 학습합니다.",
"암호학": "대칭키, 공개키, 해시함수 등 암호 시스템의 수학적 기초와 응용을 배우는 보안 핵심 과목입니다.",
"운영체제": "프로세스 관리, 메모리, 파일 시스템, 스케줄링 등 OS 내부 구조를 이해하고 구현합니다.",
"윈도우즈프로그래밍1": "Windows API를 기반으로 GUI 응용프로그램 개발과 이벤트 처리 구조를 실습합니다.",
"이산수학": "집합론, 그래프 이론, 논리, 조합론 등 컴퓨터과학에 필수적인 수학적 기초 이론을 학습합니다.",
"인공지능": "머신러닝, 신경망, 전문가 시스템 등 인공지능 기술의 원리와 응용 사례를 포괄적으로 다룹니다.",
"인터넷보안": "웹 보안, 해킹 대응, 침입탐지 시스템 등 인터넷 환경의 보안 이슈와 대응 방안을 학습합니다.",
"인터넷프로그래밍": "HTML, CSS, JavaScript, 서버-클라이언트 구조 등 웹 개발의 전반을 배우는 실습 중심 과목입니다.",
"인터넷프로토콜": "TCP/IP, HTTP, DNS 등 인터넷 통신을 구성하는 핵심 프로토콜 구조를 학습합니다.",
"인터넷활용Ⅰ": "인터넷 기반 정보 검색, 클라우드 활용, 온라인 협업 도구 등 정보 활용 능력을 기릅니다.",
"자료구조": "배열, 스택, 큐, 트리, 그래프 등의 자료 저장 구조와 알고리즘 구현 능력을 학습합니다.",
"정보보호개론": "정보 시스템 보안의 필요성과 기초 이론, 보안 위협 및 보호 기술을 소개하는 과목입니다.",
"정보처리": "정보 시스템의 개념, 정보 처리 기술, 데이터 흐름 등을 이해하며 실무 활용 능력을 키웁니다.",
"컴퓨터개론": "컴퓨터 구조, 운영체제, 프로그래밍 기초 등 컴퓨터 전반을 소개하는 입문 과목입니다.",
"컴퓨터구조": "명령어 집합, 버스 구조, 연산 장치 등 컴퓨터 하드웨어의 내부 구조를 이론적으로 학습합니다.",
"컴퓨터구조및아키텍처": "CPU 설계, 병렬처리, 캐시메모리 등 고급 하드웨어 설계 개념까지 확장된 심화 과목입니다.",
"컴퓨터그래픽Ⅰ": "2D·3D 그래픽 이론, 렌더링 기술, 오픈GL 기반 시각화 프로그래밍을 학습합니다.",
"컴퓨터네트워크": "데이터 통신망의 구성과 동작 원리, 네트워크 프로토콜 및 설계 기초를 학습합니다.",
"컴퓨터시스템": "하드웨어, 운영체제, 응용 소프트웨어의 통합적 작동 원리를 이해하고 시스템 관점에서 분석합니다.",
"파이썬프로그래밍": "파이썬 문법, 자료형, 함수, 파일 입출력 등 프로그래밍 기본기를 실습 중심으로 학습합니다.",
"프로그래밍언어실습": "다양한 언어의 문법과 특성을 실습하며 프로그래밍 응용력을 강화하는 실무 중심 과목입니다.",
"C언어1": "변수, 조건문, 반복문, 배열 등 C언어의 기본 문법과 구조를 익히며 절차지향 프로그래밍의 기초를 다집니다.",
"토목재료1": "콘크리트, 철근, 아스팔트 등 토목 구조물에 사용되는 주요 재료의 물리·화학적 특성과 시험 방법을 학습합니다.",
"평생교육경영론": "평생교육 기관 운영, 인사관리, 조직구조 설계 등 교육 경영 전반을 배우는 실무 중심 과목입니다.",
"평생교육론": "평생학습 사회에서의 교육 개념과 철학, 제도적 기반, 실천 전략 등을 통합적으로 이해합니다.",
"평생교육방법론": "성인 학습자 특성에 맞춘 교수법, 참여형 학습 전략, 교육 기획 방법 등을 중심으로 구성된 과목입니다.",
"평생교육프로그램개발론": "학습자의 요구 조사부터 교육과정 설계, 실행, 평가까지 프로그램 개발 전 과정을 실습 중심으로 배웁니다.",
"행정조사론": "행정 정책 및 서비스 개선을 위한 설문, 통계, 인터뷰 등 다양한 조사 방법과 분석 기법을 학습합니다.",
"행정학개론": "행정의 개념, 원칙, 정부 조직, 정책 과정 등 행정학 전반을 폭넓게 이해하는 입문 과목입니다.",
"세무회계1": "부가가치세, 소득세, 법인세 등 주요 세목의 계산과 처리 방법을 중심으로 한 세무 회계 입문 과목입니다.",
"원가관리회계1": "제조원가 계산, 제품원가 산정, 원가 흐름의 기초 개념과 회계처리를 배우는 과목입니다.",
"원가관리회계2": "원가분석, 예산통제, CVP 분석 등 관리 회계의 심화 내용을 학습하는 고급 과목입니다.",
"중급재무회계1": "자산, 부채, 자본의 측정 및 보고 기준 등 기업의 재무 상태를 정밀하게 이해하는 과목입니다.",
"중급재무회계2": "수익 인식, 리스, 충당부채 등 복잡한 회계 기준을 중심으로 한 고급 재무회계 과목입니다.",
"통계학": "회계 및 경영 분야에서 활용되는 기술통계, 확률, 회귀분석 등의 기초 통계 개념을 학습합니다.",
"회계감사": "외부 감사 절차, 감사 보고서 작성, 내부통제 평가 등 회계감사 실무와 기준을 배우는 과목입니다.",
"회계와사회": "회계정보의 사회적 역할, 기업 윤리, 이해관계자 간 회계 정보의 활용 등을 폭넓게 고찰합니다.",
"회계원리": "분개, 전기, 결산 등 회계의 기본 순환과정을 이해하는 회계학의 입문 과목입니다.",
"회계정보시스템1": "회계 데이터 처리 자동화, 전산회계 시스템 운용 등을 중심으로 한 정보 시스템 실무 과목입니다."
}
